# Написать функцию season, принимающую 1 аргумент — номер месяца (от 1 до 12), и
# возвращающую время года, которому этот месяц принадлежит (зима, весна, лето или осень).


def season(month_number: int = ""):
    months = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето",
              9: "осень", 10: "осень", 11: "осень", 12: "зима"}
    return months[month_number]


if __name__ == "__main__":
    print(season(6))
    print(season(11))
    print(season(1))
    print(season(4))
